# coding=utf-8
"""
Имеется простой односвязный список размера N. Необходимо реализовать алгоритм, который перепаковывает список так,
чтобы за первым элеметом следовал последний, затем второй, затем предпоследний и т. д. Пример работы алгоритма:
исходный список: 1-2-3-4-5-6-7-8
перепакованный список: 1-8-2-7-3-6-4-5.
Оценить сложность предложенного алгоритма.
Реализация требуется на С++ и/или Python.
"""


def repack_list(lst):

    if len(lst) % 2 == 0:
        times = (len(lst) - 2) / 2
    else:
        times = len(lst) / 2

    i = 1
    for _ in range(times):
        # print i, ' | ', lst[i], ' --> ', lst[-1]
        lst.insert(i, lst.pop())
        i += 2

    return lst


if __name__ == '__main__':
    test_list = range(1, 9)
    print test_list
    print repack_list(test_list)
