# coding=utf-8
"""
Имеется вектор размера N. Необходимо разделить его на M < N равных частей (то есть чтобы количество элементов в каждой
части было одинаковым). Части не должны пересекаться и должны покрывать весь вектор
(исключение - допускаются промежутки от начала вектора до начала первой части и от конда последней части
до конца вектора, но в этом случае необходимо добиться, чтобы разница в величине этих промежутков была минимальной).

Результатом должны являться индексы начала и конца каждой части
(либо вывод на экран, либо сохранение в любую структуру данных).
"""


def divide_vector(n, m):
    if m >= n:
        raise ValueError

    part_length = n / m  # Размер выделяемых из вектора частей
    wasted_elements = n % m  # Число выпавших элементов
    start_positions = range(wasted_elements / 2, wasted_elements / 2 + part_length * m, part_length)
    result = [[start, start + part_length - 1] for start in start_positions]
    print result


if __name__ == '__main__':
    # n = 11
    # m = 4
    n = int(input('N = '))
    m = int(input('M = '))
    divide_vector(n, m)
